tests/load-tests/artillery/ridely-service/estimate-ride-no-auth.yaml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 30
      arrivalRate: 5
  processor: "./functions.js"
  payload:
    path: "./users.csv"
    fields:
      - username
      - password
    order: sequence # ou "random" se preferir
  http:
    requestTimeout: 10000 # 10000
    headers:
      Content-Type: application/json

scenarios:
  - name: Estimate Ride (Non Authenticated)
    flow:
#      - function: "authenticate"
      - function: "requestDriverDataGenerator"
      - post:
          url: "/api/v1/rides/request-driver"
          headers:
            Custom-User: "{{ username }}"
#            Authorization: "Bearer {{ token }}"
          json: "{{ ride_data }}"
          capture:
            - json: "$.data.id"
              as: "ride_id"
      - post:
          url: "/api/v1/rides/{{ ride_id }}/estimate-ride"
          headers:
            Custom-User: "{{ username }}"
#            Authorization: "Bearer {{ token }}"