tests/load-tests/artillery/ridely-service/status.yaml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 30   # duração do teste em segundos
      arrivalRate: 10  # 10 usuários por segundo
  processor: "./functions.js"
  payload:
    path: "./users.csv"
    fields:
      - username
      - password
    order: sequence # ou "random" se preferir
  http:
    requestTimeout: 10000 # 10000
    headers:
      Content-Type: application/json

scenarios:
  - name: List Drivers (Authenticated)
    flow:
#      - function: "authenticate"
      - get:
          url: "/status"
          headers:
            Custom-User: "{{ username }}"
#            Authorization: "Bearer {{ token }}"